# proton suite
cask "protonvpn" # vpn
cask "proton-pass" # password manager
cask "proton-mail" # email client
cask "proton-drive" # cloud storage

# browsers
cask "brave-browser" # chrome based
cask "zen" # firefox based

# dev tools
cask "raycast" # spotlight replacement
cask "ghostty" # terminal emulator
cask "cursor" # code editor
cask "zed" # code editor
cask "beekeeper-studio" # db client
cask "bruno" # api client
cask "spotify" # music player
cask "obsidian" # notes app
cask "discord" # messaging app
cask "font-jetbrains-mono"

# system tools
brew "git" # version control
brew "stow" # dotfiles manager

# shell
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
